Revit 2026 API

# XYZDivision Operator

---

Divides the specified vector by the specified value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static XYZ operator /(
	XYZ left,
	double value
)
```
```vb
Public Shared Operator / (
	left As XYZ,
	value As Double
) As XYZ
```
```cpp
public:
static XYZ^ operator /(
	XYZ^ left,
	double value
)
```
```fsharp
static let inline (/)
        left : XYZ *
        value : float  : XYZ
```

#### Parameters

left XYZ
    The value to divide the vector by.
value Double
    The vector to divide by the value.

#### Return Value

XYZThe divided vector.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when source is . |
| ArgumentException | Thrown when the specified value is an infinite number or zero. |

The divided vector is obtained by dividing each coordinate of the specified vector by the specified value.

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace